package main

/*
Задача: необходимо написать функцию, которая будет принимать на вход строку (сообщение)
и маскировать там все ссылки, заменяя их на звездочки.

Правила выполнения:
- Не использовать стандартную библиотечную функцию или сторонние пакеты (strings.replace и тп)
Нужно решить задачу, только манипулируя байтами напрямую.
- Не используйте конкатенацию строк (оператор +)
- Маскировать только ссылки, начинающиеся с http://
- Не проверять наличие прописных/строчных букв

Подсказка: создайте новый байтовый срез в качестве буфера из заданного строкового аргумента.
Затем манипулируйте им во время вашей программы.
И затем распечатайте этот буфер.

Пример выполнения:
input: Hello, its my page: http://localhost123.com See you
Output: Hello, its my page: http://**************** See you

Решение залить на гитхаб, создать отдельную ветку и прислать пулл реквест.
*/

const testString string = "Hello, its my page: http://localhost123.com and another page http://localhost123234.com See you"

func main() {
	// init project
}
